IDEA StatiCa Open Model
ConcreteULSCheckResultInteractionEc2 Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 ULS Check Interaction Ec2
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckResultBase
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultInteraction
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultInteractionEc2
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class ConcreteULSCheckResultInteractionEc2 : ConcreteULSCheckResultInteraction
Public Class ConcreteULSCheckResultInteractionEc2
	Inherits ConcreteULSCheckResultInteraction
public ref class ConcreteULSCheckResultInteractionEc2 : public ConcreteULSCheckResultInteraction
The ConcreteULSCheckResultInteractionEc2 type exposes the following members.
Constructors
Name | Description
ConcreteULSCheckResultInteractionEc2
Initializes a new instance of the ConcreteULSCheckResultInteractionEc2 class
Top
Properties
Name | Description
Check
 settings of check type
 (Inherited from ConcreteCheckResultBase.)
CheckValue
 calculated limited value, calculated as strain to limit strain
 (Inherited from ConcreteCheckResultBase.)
CheckValueShearAndTorsion
 Calculated value of the exploitation of the cross-section (for interaction of shear and torsion) related to the limit value
CheckValueShearTorsionAndBending
 Calculated value of the exploitation of the cross-section (for interaction of shear, torsion and bending) related to the limit value
InternalFores
 internal forces used for calculation
 (Inherited from ConcreteCheckResultBase.)
LimitCheckValue
 limit check value for result check
 (Inherited from ConcreteCheckResultBase.)
Medy
 Design value of the applied bending moment around y axis
Medz
 Design value of the applied bending moment around z axis
Ned
 Design value of the applied axial force
NonConformities
 Returns nonconformity in section
 (Inherited from ConcreteCheckResultBase.)
Result
 check result passed/failed
 (Inherited from ConcreteCheckResultBase.)
Ted
 Design value of the applied torsional moment
Ved
 Design value of the applied shear force
Top
See Also
Reference
IdeaRS.OpenModel.Concrete.CheckResult Namespace